
## Plan Result (shared)

[CI link](https://github.com/goda6565/portfolio/actions/runs/16100516124)


<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.bootstrap.google_project_service.service[&#34;firebase.googleapis.com&#34;]
  * module.firebase.google_firebase_project.firebase_project


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.bootstrap.google_project_service.service["firebase.googleapis.com"] will be created
  + resource "google_project_service" "service" {
      + check_if_service_has_usage_on_destroy = true
      + disable_on_destroy                    = false
      + id                                    = (known after apply)
      + project                               = "portfolio-460206"
      + service                               = "firebase.googleapis.com"
    }

  # module.firebase.google_firebase_project.firebase_project will be created
  + resource "google_firebase_project" "firebase_project" {
      + display_name   = (known after apply)
      + id             = (known after apply)
      + project        = "projects/portfolio-460206"
      + project_number = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>




## :warning: Errors

* add a label shared/add-or-update: POST https://api.github.com/repos/goda6565/portfolio/issues/48/labels: 403 You do not have permission to create labels on this repository. [{Resource:Repository Field:label Code:unauthorized Message:}]
<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":48,"Program":"tfcmt","SHA1":"c90e2f9b7f97c8531ab154c6a46d03de0a497f3d","Target":"shared","Vars":{},"WorkflowName":"Terraform Multi-Env CI"} -->